#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.private_key: Refreshing state... [id=5af6128919c7737bd800099d691dbc6e39de6bbd]
linode_nodebalancer.app_nb: Refreshing state... [id=187622]
linode_domain.domain: Refreshing state... [id=1770909]
acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/344815320]
linode_instance.db: Refreshing state... [id=33374522]
linode_instance.app[0]: Refreshing state... [id=33374521]
linode_domain_record.rewards: Refreshing state... [id=19852316]
linode_firewall.fealty_fw[0]: Refreshing state... [id=39339]
acme_certificate.certificate: Refreshing state... [id=c8a3e672-6d2c-954b-ff46-c5001ca7a90d]
linode_nodebalancer_config.app_nb_config: Refreshing state... [id=267571]
linode_nodebalancer_node.app_nb_node[0]: Refreshing state... [id=38124718]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # linode_nodebalancer.app_nb has changed
  ~ resource "linode_nodebalancer" "app_nb" {
        id                   = "187622"
        tags                 = [
            "fealty",
        ]
      ~ transfer             = [
          ~ {
              ~ in    = 0.000270843505859375 -> 0.033344268798828125
              ~ out   = 0.000152587890625 -> 0.05684185028076172
              ~ total = 0.000423431396484375 -> 0.09018611907958984
            },
        ]
        # (8 unchanged attributes hidden)
    }

  # linode_nodebalancer_config.app_nb_config has changed
  ~ resource "linode_nodebalancer_config" "app_nb_config" {
        id              = "267571"
      ~ node_status     = [
          ~ {
              ~ down = 1 -> 0
              ~ up   = 0 -> 1
            },
        ]
        # (18 unchanged attributes hidden)
    }

  # linode_nodebalancer_node.app_nb_node[0] has changed
  ~ resource "linode_nodebalancer_node" "app_nb_node" {
        id              = "38124718"
      ~ status          = "Unknown" -> "UP"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # linode_firewall.fealty_fw[0] will be updated in-place
  ~ resource "linode_firewall" "fealty_fw" {
        id              = "39339"
      ~ linodes         = [
          - 33374521,
        ] -> (known after apply)
        tags            = [
            "fealty",
        ]
        # (6 unchanged attributes hidden)


        # (5 unchanged blocks hidden)
    }

  # linode_instance.app[0] must be replaced
-/+ resource "linode_instance" "app" {
      ~ backups            = [
          - {
              - enabled  = false
              - schedule = [
                  - {
                      - day    = ""
                      - window = ""
                    },
                ]
            },
        ] -> (known after apply)
      ~ boot_config_label  = "My fealty-app Profile" -> (known after apply)
      ~ id                 = "33374521" -> (known after apply)
      ~ image              = "private/15102783" -> "dummy" # forces replacement
      ~ ip_address         = "45.79.197.50" -> (known after apply)
      ~ ipv4               = [
          - "192.168.139.236",
          - "45.79.197.50",
        ] -> (known after apply)
      ~ ipv6               = "2600:3c02::f03c:92ff:fe1b:1815/128" -> (known after apply)
      ~ private_ip_address = "192.168.139.236" -> (known after apply)
      ~ specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> (known after apply)
      ~ status             = "running" -> (known after apply)
      ~ swap_size          = 512 -> (known after apply)
        tags               = [
            "fealty",
        ]
        # (7 unchanged attributes hidden)

      ~ alerts {
          ~ cpu            = 90 -> (known after apply)
          ~ io             = 10000 -> (known after apply)
          ~ network_in     = 10 -> (known after apply)
          ~ network_out    = 10 -> (known after apply)
          ~ transfer_quota = 80 -> (known after apply)
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-app Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67215794 -> null
                  - disk_label = "fealty-app" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67215795 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - purpose = "public" -> null
            }
          - interface {
              - ipam_address = "10.10.10.2/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67215794 -> null
          - label            = "fealty-app" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67215795 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

      ~ interface {
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # linode_instance.db must be replaced
-/+ resource "linode_instance" "db" {
      ~ backups            = [
          - {
              - enabled  = true
              - schedule = [
                  - {
                      - day    = "Scheduling"
                      - window = "Scheduling"
                    },
                ]
            },
        ] -> (known after apply)
      ~ boot_config_label  = "My fealty-db Profile" -> (known after apply)
      ~ id                 = "33374522" -> (known after apply)
      ~ image              = "private/15102789" -> "dummy" # forces replacement
      ~ ip_address         = "45.79.197.72" -> (known after apply)
      ~ ipv4               = [
          - "45.79.197.72",
        ] -> (known after apply)
      ~ ipv6               = "2600:3c02::f03c:92ff:fe1b:1897/128" -> (known after apply)
      - private_ip         = false -> null
      + private_ip_address = (known after apply)
      ~ specs              = [
          - {
              - disk     = 25600
              - memory   = 1024
              - transfer = 1000
              - vcpus    = 1
            },
        ] -> (known after apply)
      ~ status             = "running" -> (known after apply)
      ~ swap_size          = 512 -> (known after apply)
        tags               = [
            "fealty",
        ]
        # (6 unchanged attributes hidden)

      ~ alerts {
          ~ cpu            = 90 -> (known after apply)
          ~ io             = 10000 -> (known after apply)
          ~ network_in     = 10 -> (known after apply)
          ~ network_out    = 10 -> (known after apply)
          ~ transfer_quota = 80 -> (known after apply)
        }

      - config {
          - kernel       = "linode/latest-64bit" -> null
          - label        = "My fealty-db Profile" -> null
          - memory_limit = 0 -> null
          - root_device  = "/dev/sda" -> null
          - run_level    = "default" -> null
          - virt_mode    = "paravirt" -> null

          - devices {
              - sda {
                  - disk_id    = 67215796 -> null
                  - disk_label = "fealty-db" -> null
                  - volume_id  = 0 -> null
                }

              - sdb {
                  - disk_id    = 67215797 -> null
                  - disk_label = "512 MB Swap Image" -> null
                  - volume_id  = 0 -> null
                }
            }

          - helpers {
              - devtmpfs_automount = true -> null
              - distro             = true -> null
              - modules_dep        = true -> null
              - network            = true -> null
              - updatedb_disabled  = true -> null
            }

          - interface {
              - ipam_address = "10.10.10.3/24" -> null
              - label        = "fealty-vlan" -> null
              - purpose      = "vlan" -> null
            }
        }

      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "ext4" -> null
          - id               = 67215796 -> null
          - label            = "fealty-db" -> null
          - read_only        = false -> null
          - size             = 25088 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }
      - disk {
          - authorized_keys  = [] -> null
          - authorized_users = [] -> null
          - filesystem       = "swap" -> null
          - id               = 67215797 -> null
          - label            = "512 MB Swap Image" -> null
          - read_only        = false -> null
          - size             = 512 -> null
          - stackscript_data = (sensitive value)
          - stackscript_id   = 0 -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ DB_Private_IP = [
      - "10.10.10.3/24",
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @biodrone, Action: `pull_request`, Working Directory: `deploy`, Workflow: `CI`*